JamHaven/STM32CubeFunctionPack_AZURE1_V3.3.2/Projects/Multi/Applications/Azure_Motor/Inc/TargetFeatures.h
/**
  ******************************************************************************
  * @file    TargetFeatures.h 
  * @author  Central LAB
  * @version V3.3.0
  * @date    08-May-2018
  * @brief   Specification of the HW Features for each target platform
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2018 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/  
#ifndef _TARGET_FEATURES_H_
#define _TARGET_FEATURES_H_

#ifdef __cplusplus
 extern "C" {
#endif 

/* Includes ------------------------------------------------------------------*/
#include <stdlib.h>
#ifdef USE_STM32L4XX_NUCLEO
  #include "stm32l4xx_hal.h"
  #include "stm32l4xx_nucleo.h"
  #include "stm32l4xx_hal_conf.h"
  #include "stm32l4xx_UART.h"
  #include "stm32l4xx_SPI.h"
  #include "stm32l4xx_I2C.h"
  #include "stm32l4xx_periph_conf.h"
#else /* USE_STM32L4XX_NUCLEO */
  #ifdef USE_STM32L475E_IOT01
    #include "stm32l4xx_hal.h"
    #include "stm32l4xx_hal_conf.h"
    #include "stm32l475e_iot01.h"
    #include "stm32l475e_iot01_tsensor.h"
  #endif /* USE_STM32L475E_IOT01 */
#endif /* USE_STM32L4XX_NUCLEO */

#include "xnucleoihm02a1_interface.h"
#include "xnucleoihm02a1.h"

#ifdef USE_STM32L475E_IOT01
  #include "m24sr_wrapper.h"
  #include "lib_TagType4.h"
#else /* USE_STM32L475E_IOT01 */
  #include "tagtype5_wrapper.h"
  #include "lib_NDEF_URI.h"
  #include "lib_NDEF_Wifi.h"
  #include "lib_NDEF_Text.h"
#endif /* USE_STM32L475E_IOT01 */

#ifdef USE_STM32L475E_IOT01
#include "wifi.h"
#endif /* USE_STM32L475E_IOT01 */
#include "params.h"
#include "azure1_config.h"

/* Exported defines ------------------------------------------------------- */

/* Exported types ------------------------------------------------------- */

/**
 * @brief  Target's Features data structure definition
 */
typedef struct
{
  RTC_HandleTypeDef RtcHandle;
  uint32_t TIM_CC1_Pulse;
  uint32_t NFCInitialized;
  StepperMotorBoardHandle_t *StepperMotorBoardHandle;
  int32_t MotorBoardStep;

  RNG_HandleTypeDef  RngHandle;
} TargetFeatures_t;

/* Exported variables ------------------------------------------------------- */
extern TargetFeatures_t TargetBoardFeatures;
#ifdef USE_STM32L475E_IOT01
extern UART_HandleTypeDef UartHandle;
#endif /* USE_STM32L475E_IOT01 */

#ifdef __cplusplus
}
#endif

#endif /* _TARGET_FEATURES_H_ */

/******************* (C) COPYRIGHT 2018 STMicroelectronics *****END OF FILE****/

